backend/sped/cte/09204054000143/producao/temporarias/201709/31170911095658000140570010000002831181710495-consSitCTe.xml

<?xml version="1.0" encoding="utf-8"?><soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope"><soap12:Header><cteCabecMsg xmlns="http://www.portalfiscal.inf.br/cte/wsdl/CteConsulta"><cUF>31</cUF><versaoDados>2.00</versaoDados></cteCabecMsg></soap12:Header><soap12:Body><cteDadosMsg xmlns="http://www.portalfiscal.inf.br/cte/wsdl/CteConsulta"><consSitCTe xmlns="http://www.portalfiscal.inf.br/cte" versao="2.00"><tpAmb>1</tpAmb><xServ>CONSULTAR</xServ><chCTe>31170911095658000140570010000002831181710495</chCTe></consSitCTe></cteDadosMsg></soap12:Body></soap12:Envelope>